cases/rhoPisoMRCase/0/fluidVolume/N2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 0 0 0 0 ];

internalField   uniform 0.79;

boundaryField
{
    channelWalls
    {
        type            zeroGradient;
        value           uniform 0.79;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.79;
    }
    outlet
    {
        type            inletOutlet;
        value           uniform 0.79;
        inletValue      uniform 0.79;
    }
    topWalls
    {
        type            zeroGradient;
        value           uniform 0.79;
    }
    outerWalls
    {
        type            zeroGradient;
        value           uniform 0.79;
    }
    tankWalls
    {
        type            zeroGradient;
        value           uniform 0.79;
    }
    fluidVolume_to_solidVolume
    {
        type            zeroGradient;
        value           uniform 0.79;
    }
}


// ************************************************************************* //
