cases/rhoPisoMRCase/constant/fluidVolume/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


7
(
channelWalls
{
    type            wall;
    nFaces          648;
    startFace       398856;
}

inlet
{
    type            patch;
    nFaces          180;
    startFace       399504;
}

outlet
{
    type            patch;
    nFaces          1032;
    startFace       399684;
}

topWalls
{
    type            wall;
    nFaces          840;
    startFace       400716;
}

outerWalls
{
    type            wall;
    nFaces          5112;
    startFace       401556;
}

tankWalls
{
    type            wall;
    nFaces          3132;
    startFace       406668;
}

fluidVolume_to_solidVolume
{
    type            directMappedWall;
    nFaces          4872;
    startFace       409800;
    sampleMode      nearestPatchFace;
    sampleRegion    solidVolume;
    samplePatch     solidVolume_to_fluidVolume;
    offset          ( 0 0 0 );
}

)


// ************************************************************************* //
