cases/rhoPisoMRCase/system/fluidVolume/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
//    default Euler;
    default steadyState;
}

gradSchemes
{
    default         leastSquares;
}

divSchemes
{
    default         Gauss linear;

/*--------------------------------------------------------*\
|                       limited schemes                    |
\*--------------------------------------------------------*/
//    div(phi,U)     Gauss linearUpwindV cellMDLimited Gauss linear 1;
//    div(phi,k)     Gauss linearUpwind cellMDLimited Gauss linear 1;
//    div(phi,omega) Gauss linearUpwind cellMDLimited Gauss linear 1;
//    div(phi,h)      Gauss linearUpwind cellMDLimited Gauss linear 1;
//====================================================================

//--------------------------------------------------------
//                     simple schemes
//--------------------------------------------------------
//    div(phi,U)     Gauss linearUpwind leastSquares;
//    div(phi,k)     Gauss linearUpwind leastSquares;
//    div(phi,omega) Gauss linearUpwind leastSquares;
//    div(phi,h)      Gauss linearUpwind leastSquares;
//====================================================================

/*--------------------------------------------------------*\
|                 skewCorrected schemes                    |
\*--------------------------------------------------------*/

    div(phi,U)      Gauss skewCorrected limitedLinear 1.0;
    div(phiU,p)     Gauss skewCorrected limitedLinear 1.0;
    div(phi,k)      Gauss skewCorrected limitedLinear 1.0;
    div(phi,omega) Gauss skewCorrected limitedLinear 1.0;
    div(phi,R)      Gauss skewCorrected limitedLinear 1.0;
    div(phi,symm(grad(U))) Gauss skewCorrected limitedLinear 1.0;
//====================================================================
/*-----------------------------------------------------------*\
|          This convection doesn't allow other schemes        |
\*-----------------------------------------------------------*/
    div(R)          Gauss linear;
    div((muEff*dev2(grad(U).T()))) Gauss upwind phi 1.0;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         limitedLinear phi 1.0;
}

snGradSchemes
{
    default        limited 0.5;
}

fluxRequired
{
    default         no;
    p;
}

// ************************************************************************* //
