cases/rhoPisoMRCase/system/fluidVolume/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|G)"
    {
        solver          PCG;
        tolerance       1e-12;
        relTol          0;
    }

    p
    {
        solver           GAMG;
        tolerance        1e-8;
        relTol           0;
        nPreSweeps       0;
        nPostSweeps      2;
        smoother         DICGaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
        maxIter          100;
    }
    pFinal
    {
        $p;
        tolerance 1e-8;
        maxIter 100;
    }
    "(U|k|omega|R|h|hFinal)"
    {
        solver smoothSolver;
        smoother      DILUGaussSeidel;
        nSweeps       2;
        tolerance     1e-7;
        relTol        0;
        maxIter       20;
    }
    /*
    "(U|Yj|k|omega|R)"
    {
        solver GAMG;
        smoother GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      1;
        tolerance        1e-9;
        relTol           0;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
        maxIter          100;
    }
    "(h|hFinal)"
    {
        solver smoothSolver;
        smoother      GaussSeidel;
        nSweeps       2;
        tolerance     1e-12;
        relTol        0;
        maxIter       20;
    }
    "(k|omega)"
    {
        solver PBiCG;
        preconditioner DILU;
        tolerance 1e-8;
        relTol 0;
        maxIter 1000;
    }
    */
}

PISO
{
    momentumPredictor   yes;
    nCorrectors         5;
    nNonOrthogonalCorrectors 5;
    nNonOrthCorrections 5;
    rhoMin rhoMin [1 -3 0 0 0 0 0] 1.165;
    rhoMax rhoMax [1 -3 0 0 0 0 0] 1.185;
}
relaxationFactors
{
    p               0.3;
    rho             0.05;
    U               0.7;
    k               0.7;
    epsilon         0.7;
    h               0.5;
}

// ************************************************************************* //
